#+OPTIONS: toc:nil
#+PROPERTY: header-args :dir /tmp
#+BEGIN_EXPORT html
---
layout:     post
title:      Exporting Org-mode with Babel blocks from Outside Emacs
tags:       org-mode jekyll github-actions
---
#+END_EXPORT

The reproducibility in my blog wasn't as good as it could be: I committed both the source files (in Org-mode) as the export (in Markdown) to source control.
Better for reproducibility is to regenerate the Markdown file with every build of my blog.
You need to be able to call Emacs and export Org-mode files in a script for that.
There are some intricacies on how to achieve this related to calling Emacs from the command line and exporting Org-mode with babel source code blocks.
This post is to inspire those who want to do the same or got stuck trying.

I'll focus on how to interact with Emacs when using command-line scripting because it might not be completely obvious.

* First Org-mode to Markdown export

We are now going to export an Org-mode file to Markdown from the command-line.
We'll save an example file to disk:

#+BEGIN_SRC bash :results none
cat << EOF > example.org
This is an Org-mode paragraph.

Anoter paragraph with a [[https://example.com][link]] and text in **bold**.
EOF
#+END_SRC

#+BEGIN_SRC emacs-lisp

#+END_SRC

#+RESULTS:
: This is an Org-mode paragraph.
: 
: Example [link](https://example.com) text in ****bold****.
: 

